БухЭксп/Documents/CW_ПоступлениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ПоступлениеТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_СостоянияТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ТопливоТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ПробегШин</xr:Item>
				<xr:Item>InformationRegister.CW_ПараметрыТС</xr:Item>
				<xr:Item>InformationRegister.CW_ШиныТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ПробегТС</xr:Item>
				<xr:Item>InformationRegister.CW_ПоказанияОдометровТранспортныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТранспортныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГаражныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйЗнак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробегСГрузом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТопливоКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеТранспортногоСредства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_СостоянияТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробегПорожний</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПутевыхЛистов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспортногоСредства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШиныТранспортногоСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановкиШины</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_МестаУстановкиШинТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_РегистрацонныеЗнакиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РегистрацонныеЗнакиАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_ПоступлениеТС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаВвестиШинытранспортногоСредства(Команда)
	
	ТекущиеДанные = Элементы.СписокТранспортныхСредств.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрна строка таблицы";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ТекущиеДанные.ТранспортноеСредство) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "не выбрно транспортное средство";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Адрес = ПолучитьШиныТранспортногоСредства(ТекущиеДанные.ТранспортноеСредство);
	
	СтркутураПараметров = Новый Структура;
	СтркутураПараметров.Вставить("ТранспортноеСредство",ТекущиеДанные.ТранспортноеСредство);
	СтркутураПараметров.Вставить("Адрес",Адрес);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыШин", ЭтотОбъект);
	
	ОткрытьФорму("Документ.CW_ПоступлениеТС.Форма.ФормаРедактированияШин",СтркутураПараметров,ЭтаФорма,,,,ОписаниеОповещенияОЗакрытии);

КонецПроцедуры

&НаСервере
Функция ПолучитьШиныТранспортногоСредства(ТранспортноеСредство)
	
	Отбор = новый Структура("ТранспортноеСредство", ТранспортноеСредство);
	
	мСтрокиШины = Объект.ШиныТранспортногоСредства.НайтиСтроки(Отбор);
	
	ТаблицаШин = Новый ТаблицаЗначений;
	ТаблицаШин.Колонки.Добавить("Шина");
	ТаблицаШин.Колонки.Добавить("МестоУстановкиШины");
	ТаблицаШин.Колонки.Добавить("Пробег");
	
	Для Каждого СтрокаШин из мСтрокиШины Цикл 
		ЗаполнитьЗначенияСвойств(ТаблицаШин.Добавить(), СтрокаШин);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаШин);
	
КонецФункции  

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыШин(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
	
		ОбработатьВыборНаСервере(Результат);
	
	КонецЕсли;
	
КонецПроцедуры

&наСервере
Процедура ОбработатьВыборНаСервере(СтркутураДанных)
	
	ТаблицаШин 				= ПолучитьИзВременногоХранилища(СтркутураДанных.Адрес);
	ТранспортноеСредство 	= СтркутураДанных.ТранспортноеСредство;
	
	Отбор = новый Структура("ТранспортноеСредство", ТранспортноеСредство);
	_СФ.к_УдалитьЭлементыПоОтбору(Объект.ШиныТранспортногоСредства,Отбор);	
	
	Для Каждого СтрокаТаб из ТаблицаШин Цикл
		
		НоваяСтрока = Объект.ШиныТранспортногоСредства.Добавить();
		НоваяСтрока.ТранспортноеСредство = ТранспортноеСредство;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);

	ВедетсяУчетШинТранспортногоСредства 		= ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	ВводитьДанныеОПорожнемПробегеВДокументах 	= ПолучитьФункциональнуюОпцию("CW_ВводитьДанныеОПорожнемПробегеВДокументах");	
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация 		= CW_Настройки.ОсновнаяОрганизация();
	КонецЕсли;
	
	Элементы.СписокТранспортныхСредствКомандаВвестиШинытранспортногоСредства.Видимость = ВедетсяУчетШинТранспортногоСредства;
	
	Элементы.СписокТранспортныхСредствПробегПорожний.Доступность 	= ВводитьДанныеОПорожнемПробегеВДокументах;
	Элементы.СписокТранспортныхСредствПробег.Доступность 			= Не ВводитьДанныеОПорожнемПробегеВДокументах;
	
	ТекущаяОрганизация = Объект.Организация;
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура СписокТранспортныхСредствПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока или Копирование тогда
		СтрокаПростой = Элементы.СписокТранспортныхСредств.ТекущиеДанные;
		СтрокаПростой.СостояниеТранспортногоСредства =  ПредопределенноеЗначение("Справочник.CW_СостоянияТС.Исправно");

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьПробегПоСтроке(ИндексСтроки)
	
	ТекущаяСтрока = Объект.СписокТранспортныхСредств[ИндексСтроки];
	
	Если ВводитьДанныеОПорожнемПробегеВДокументах Тогда
		ТекущаяСтрока.Пробег 			=  ТекущаяСтрока.ПробегСГрузом + ТекущаяСтрока.ПробегПорожний;
	Иначе
		ТекущаяСтрока.ПробегПорожний 	=  ТекущаяСтрока.Пробег - ТекущаяСтрока.ПробегСГрузом;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТранспортныхСредствПробегПриИзменении(Элемент)
	РасчитатьПробегПоСтроке(Элементы.СписокТранспортныхСредств.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокТранспортныхСредствПробегПорожнийПриИзменении(Элемент)
	РасчитатьПробегПоСтроке(Элементы.СписокТранспортныхСредств.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокТранспортныхСредствПробегСГрузомПриИзменении(Элемент)
	РасчитатьПробегПоСтроке(Элементы.СписокТранспортныхСредств.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокТранспортныхСредствТранспортноеСредствоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СписокТранспортныхСредств.ТекущаяСтрока;
	ЗаполнитьДанныеСтрокиПриИзмененииТранспортногоСредства(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтрокиПриИзмененииТранспортногоСредства(ИдентификаторСтроки)
	
	СтрокаТаблицы = Объект.СписокТранспортныхСредств.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если СтрокаТаблицы <> Неопределено Тогда
		
		СтрокаТаблицы.РегистрационныйЗнак = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьПредставлениеГосНомераТранспортногоСредства(Объект.Дата, СтрокаТаблицы.ТранспортноеСредство, Истина);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если Не ТекущаяОрганизация = Объект.Организация Тогда
		Объект.Номер = "";
	КонецЕсли;
	
	ТекущаяОрганизация = Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры


&НаКлиенте
Процедура СписокТранспортныхСредствТранспортноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = ложь;
	
	МассивПринадлежность = Новый Массив;
	МассивПринадлежность.Добавить(1);
	МассивПринадлежность.Добавить(2);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Принадлежность", МассивПринадлежность);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", Отбор);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.CW_ТранспортныеСредства.ФормаВыбора",СтруктураПараметров, Элемент); 
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти
